Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [71]:
import pandas as pd

In [91]:
se=pd.Series([4,8,15,16,23,42])

In [92]:
se

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [93]:
list=["Apple",777,"pw_skills","python","R",98,"data science",89,34,"inueron"]

In [94]:
df=pd.Series(list)

In [95]:
df

0           Apple
1             777
2       pw_skills
3          python
4               R
5              98
6    data science
7              89
8              34
9         inueron
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [96]:
list=[["Alice",25,"Female"],["Bob",30,"Male"],["Clair",27,"Female"]]

In [97]:
df1=pd.DataFrame(list,columns=["Name","Age","Gender"])

In [98]:
df1

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans:-  Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

EX:-

In [99]:
type(df1) # Size-mutable – Elements can be dropped or added in an existing DataFrame.
          # Heterogenous – DataFrame elements can have different data types.
          # Two-dimensional

pandas.core.frame.DataFrame

In [100]:
type(df1['Name']) # Size-immutable – Once created, the size of a Series object cannot be changed.
                  # Homogenous – Series elements must be of the same data type.
                  # One-dimensional

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans:- describe(),head(),columns,tails(),info,dtypes,types,isnull(),...... etc we can use to manipulate data in a pandas frame.

In [101]:
df1.to_csv("example.csv")

In [102]:
df2=pd.read_csv("example.csv")

In [103]:
df2

   Unnamed: 0   Name  Age  Gender
0           0  Alice   25  Female
1           1    Bob   30    Male
2           2  Clair   27  Female

In [104]:
df2.head(2)

   Unnamed: 0   Name  Age  Gender
0           0  Alice   25  Female
1           1    Bob   30    Male

In [105]:
df2.shape

(3, 4)

In [106]:
df2.columns

Index(['Unnamed: 0', 'Name', 'Age', 'Gender'], dtype='object')

In [107]:
df2.dtypes

Unnamed: 0     int64
Name          object
Age            int64
Gender        object
dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans:- DataFrame and Panel both are mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [108]:
course=pd.Series(["Hadoop","kafka","pyspark"])

In [109]:
fees=pd.Series( [30000,45000,50000])

In [110]:
time=pd.Series(["1 year","1 year","1 year"])

In [111]:
freame={"course":course,
         "fees":fees,
         "time":time}

In [112]:
pd.DataFrame(freame)

    course   fees    time
0   Hadoop  30000  1 year
1    kafka  45000  1 year
2  pyspark  50000  1 year